backend/TransactionSign.Tests/LoadTests/results/20260415-123516/k6-output.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: C:\Users\Davit Gabrielyan\source\repos\TransactionSign\backend\TransactionSign.Tests\LoadTests\k6-workflow.js
        output: -

     scenarios: (100.00%) 2 scenarios, 11 max VUs, 30m5s max duration (incl. graceful stop):
              * monitor: 1 looping VUs for 30m0s (exec: monitorCompletion)
              * signers: 10 looping VUs for 30m0s (exec: signerFlow, gracefulStop: 5s)


running (00m01.0s), 11/11 VUs, 7 complete and 0 interrupted iterations
monitor   [   0% ] 1 VUs   00m01.0s/30m0s
signers   [   0% ] 10 VUs  00m01.0s/30m0s

running (00m02.0s), 11/11 VUs, 10 complete and 0 interrupted iterations
monitor   [   0% ] 1 VUs   00m02.0s/30m0s
signers   [   0% ] 10 VUs  00m02.0s/30m0s

running (00m03.0s), 11/11 VUs, 10 complete and 0 interrupted iterations
monitor   [   0% ] 1 VUs   00m03.0s/30m0s
signers   [   0% ] 10 VUs  00m03.0s/30m0s

running (00m04.0s), 11/11 VUs, 10 complete and 0 interrupted iterations
monitor   [   0% ] 1 VUs   00m04.0s/30m0s
signers   [   0% ] 10 VUs  00m04.0s/30m0s

running (00m05.0s), 11/11 VUs, 10 complete and 0 interrupted iterations
monitor   [   0% ] 1 VUs   00m05.0s/30m0s
signers   [   0% ] 10 VUs  00m05.0s/30m0s

running (00m06.0s), 11/11 VUs, 10 complete and 0 interrupted iterations
monitor   [   0% ] 1 VUs   00m06.0s/30m0s
signers   [   0% ] 10 VUs  00m06.0s/30m0s
time="2026-04-15T12:35:22+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T08:35:22.707Z\",\"kind\":\"sign_fail\",\"userId\":9,\"txId\":2,\"error\":\"Signature limit reached\"}" source=console
time="2026-04-15T12:35:22+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T08:35:22.708Z\",\"kind\":\"sign_fail\",\"userId\":4,\"txId\":2,\"error\":\"Signature limit reached\"}" source=console

running (00m07.0s), 11/11 VUs, 14 complete and 0 interrupted iterations
monitor   [   0% ] 1 VUs   00m07.0s/30m0s
signers   [   0% ] 10 VUs  00m07.0s/30m0s

running (00m08.0s), 11/11 VUs, 14 complete and 0 interrupted iterations
monitor   [   0% ] 1 VUs   00m08.0s/30m0s
signers   [   0% ] 10 VUs  00m08.0s/30m0s
time="2026-04-15T12:35:25+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T08:35:25.214Z\",\"kind\":\"sign_fail\",\"userId\":2,\"txId\":3,\"error\":\"Signature limit reached\"}" source=console
time="2026-04-15T12:35:25+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T08:35:25.215Z\",\"kind\":\"sign_fail\",\"userId\":9,\"txId\":3,\"error\":\"Signature limit reached\"}" source=console

running (00m09.0s), 11/11 VUs, 19 complete and 0 interrupted iterations
monitor   [   0% ] 1 VUs   00m09.0s/30m0s
signers   [   0% ] 10 VUs  00m09.0s/30m0s
time="2026-04-15T12:35:25+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T08:35:25.512Z\",\"kind\":\"sign_fail\",\"userId\":6,\"txId\":3,\"error\":\"Transaction not eligible for signing\"}" source=console
time="2026-04-15T12:35:25+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T08:35:25.661Z\",\"kind\":\"sign_fail\",\"userId\":1,\"txId\":2245,\"error\":\"Transaction not eligible for signing\"}" source=console
time="2026-04-15T12:35:25+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T08:35:25.682Z\",\"kind\":\"sign_fail\",\"userId\":8,\"txId\":3,\"error\":\"Transaction not eligible for signing\"}" source=console
time="2026-04-15T12:35:25+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T08:35:25.683Z\",\"kind\":\"sign_fail\",\"userId\":4,\"txId\":1,\"error\":\"Transaction not eligible for signing\"}" source=console
time="2026-04-15T12:35:25+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T08:35:25.722Z\",\"kind\":\"sign_fail\",\"userId\":2,\"txId\":1,\"error\":\"Transaction not eligible for signing\"}" source=console
time="2026-04-15T12:35:26+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T08:35:26.172Z\",\"kind\":\"sign_fail\",\"userId\":6,\"txId\":2248,\"error\":\"Transaction not eligible for signing\"}" source=console
time="2026-04-15T12:35:26+04:00" level=info msg="{\"level\":\"fail\",\"ts\":\"2026-04-15T08:35:26.285Z\",\"kind\":\"sign_fail\",\"userId\":4,\"txId\":4,\"error\":\"Transaction not eligible for signing\"}" source=console

running (00m10.0s), 11/11 VUs, 31 complete and 0 interrupted iterations
monitor   [   1% ] 1 VUs   00m10.0s/30m0s
signers   [   1% ] 10 VUs  00m10.0s/30m0s
time="2026-04-15T12:35:26+04:00" level=info msg="{\"level\":\"info\",\"action\":\"complete\",\"message\":\"All transactions signed\",\"ts\":\"2026-04-15T08:35:26.488Z\"}" source=console

running (00m11.0s), 11/11 VUs, 46 complete and 0 interrupted iterations
monitor   [   1% ] 1 VUs   00m11.0s/30m0s
signers   [   1% ] 10 VUs  00m11.0s/30m0s

running (00m12.0s), 11/11 VUs, 57 complete and 0 interrupted iterations
monitor   [   1% ] 1 VUs   00m12.0s/30m0s
signers   [   1% ] 10 VUs  00m12.0s/30m0s

running (00m13.0s), 11/11 VUs, 73 complete and 0 interrupted iterations
monitor   [   1% ] 1 VUs   00m13.0s/30m0s
signers   [   1% ] 10 VUs  00m13.0s/30m0s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.10' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 123     9.41715/s
    checks_succeeded...: 100.00% 123 out of 123
    checks_failed......: 0.00%   0 out of 123

    ✓ pending 200
    ✓ sign 200

    CUSTOM
    signing_duration_ms............: avg=1324.387097 min=2        med=15       max=8130   p(90)=5746  p(95)=7131 
    successful_signs...............: 20    1.531244/s
    workflow_failures..............: 11    0.842184/s

    HTTP
    http_req_duration..............: avg=619.79ms    min=504.2µs  med=4.19ms   max=8.12s  p(90)=2.02s p(95)=5.74s
      { expected_response:true }...: avg=619.79ms    min=504.2µs  med=4.19ms   max=8.12s  p(90)=2.02s p(95)=5.74s
    http_req_failed................: 0.00% 0 out of 123
    http_reqs......................: 123   9.41715/s

    EXECUTION
    iteration_duration.............: avg=1.89s       min=278.09ms med=789.97ms max=13.06s p(90)=6.28s p(95)=8.18s
    iterations.....................: 74    5.665602/s
    vus............................: 11    min=11       max=11
    vus_max........................: 11    min=11       max=11

    NETWORK
    data_received..................: 97 kB 7.4 kB/s
    data_sent......................: 16 kB 1.2 kB/s



running (00m13.1s), 00/11 VUs, 73 complete and 11 interrupted iterations
monitor ✗ [   1% ] 1 VUs   00m13.1s/30m0s
signers ✗ [   1% ] 10 VUs  00m13.1s/30m0s
time="2026-04-15T12:35:29+04:00" level=error msg="test aborted: All transactions signed - test complete at monitorCompletion (file:///C:/Users/Davit%20Gabrielyan/source/repos/TransactionSign/backend/TransactionSign.Tests/LoadTests/k6-workflow.js:177:24(88))"